<template>
    <div>
        <div class="content">

            <h1>注册协议</h1>
            <h4>提示条款</h4>
            <p>
                欢迎您（下称"用户"或"您"）与机锋平台经营者（详见定义条款）共同签署本《用户注册协议》（下称“本协议”）并使用机锋平台服务！
                各条款标题仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述
            </p>
            <br>
            <p>
                【审慎阅读】您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免
                除或限制责任的条款、法律适用和争议解决条款。免除或限制责任的条款将以粗体下划线标识，您应重点阅读。若您对协议有任何疑问，可向机锋平台客服咨询
            </p>
            <p>
                【签约动作】当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议
                的全部内容，并与机锋平台达成一致，成为机锋平台
                “用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
                如果您未申请注册流程，或者在本协议生效前已成为机锋平台的注册用户，则您通过访问和/或使用机锋平台，即视为您表示同意接受本协议的全部内容，
                否则请您不要访问或使用机锋平台。
            </p>



            <h4>一、定义</h4>
            <p>机锋平台：指机锋网（域名为gfan.com）网站及客户端。</p>
            <p>
                机锋平台服务：机锋基于互联网，以包含机锋平台网站、客户端等在内的各种形态（包括未来技术发展出现的新的服务形态）向您提供的各项服务。
            </p>
            <p>机锋平台服务提供者：北京微游科技有限公司</p>
            <p>
                机锋平台规则：包括在所有机锋平台网站内已经发布及后续发布的全部规则、解读、公告等内容以及机锋平台各频道、活动页面、圈子等发布的各类规则、实施细则、产品说明、公告等。
            </p>
            <p>
                用户：下称“您”或“用户”，是指注册、登录、使用、浏览、获取本协议项下服务的个人或组织。
            </p>

            <h4>二、协议范围</h4>
            <h5>2.1签约主体</h5>
            <br>
            <p>
                本协议是您与机锋平台之间关于注册、登录机锋平台以及使用机锋平台服务所订立的协议。本协议对您与机锋平台经营者均具有合同效力。
            </p>
            <p>
                机锋平台经营者是指经营机锋平台的各法律主体，您可随时查看机锋平台网站首页底部公示的证照信息以确定与您履约的机锋主体。
                本协议项下，机锋平台经营者可能根据机锋平台的业务调整而发生变更，变更后的机锋平台经营者与您共同履行本协议并向您提供服务，
                机锋平台经营者的变更不会影响您本协议项下的权益。机锋平台经营者还有可能因为提供新的机锋平台服务而新增，如您使用新增的机锋平台服务的，
                视为您同意新增的机锋平台经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与
                您履约的主体及争议相对方。
            </p>
            <p>2.2补充协议</p>
            <p>
                由于互联网高速发展，您与机锋签署的本协议列明的条款并不能完整罗列并覆盖您与机锋所有权利与义务，
                现有的约定也不能保证完全符合未来发展的需求。因此，机锋平台公示的相关声明及政策、机锋平台规则和协议均为本协议的补充协议，
                与本协议不可分割且具有同等法律效力。如您使用机锋平台服务，视为您同意上述补充协议。
            </p>

            <h4>三、账户注册与使用</h4>
            <h5>3.1用户资格</h5>
            <br>
            <p>
                您确认，在您开始使用/注册程序使用机锋平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。
                若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。
            </p>
            <p>
                特别地，如果您是未成年人，请在您的监护人的陪同下审阅和接受本协议。未成年人应当在合理程度内使用机锋平台，
                不得因使用机锋平台而影响了日常的学习生活。您理解机锋平台无义务对本款前述事项进行任何形式的审查和确认。
            </p>

            <h5>3.2账户说明</h5>
            <br>
            <p>
                当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得机锋平台账户并成为机锋平台用户。
            </p>
            <p>
                您有权使用您设置或确认的机锋用户名（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录机锋平台。
                由于您的机锋账户关联您的个人信息及机锋平台商业信息，您的机锋账户仅限您本人使用。未经机锋平台同意，您直接或间接授权第三方使用您机
                锋账户或获取您账户项下信息的行为所导致的一切责任后果由您自行承担，机锋平台对此不承担任何责任。但如若机锋平台判断您机锋账户的使用
                可能危及您的账户安全及/或机锋平台信息安全的，机锋平台可拒绝提供相应服务或终止本协议。
                由于用户账户关联用户信用信息，仅当有法律明
                文规定、司法裁定或经机锋同意，并符合机锋平台规则规定的用户账户转让流程的情况下，您可进行账户的转让。您的账户一经转让，该账户项下
                权利义务一并转移。除此外，您的账户不得以任何方式转让，否则由此产生的一切责任均由您承担。
            </p>
            <p>
                作为机锋平台经营者，为使您更好地使用机锋平台的各项服务，保障您的账户安全，机锋可要求您按机锋平台要求及我国法律规
                定完成实名认证。如您的账户长期未登录，机锋有权予以进行注销、回收、替换或采取删除该用您账户在机锋平台数据库中的任何记录
                （包括但不限于注册信息、虚拟礼物信息等）等清理措施，您的账户将不能再登录任一机锋平台，相应服务同时终止。机锋在对此类账户进行清理前，
                将以包括但不限于弹窗、网站公告、站内消息、客户端推送信息等方式通知您。
            </p>

            <h5>3.3注册信息管理</h5>
            <br>
            <p>3.3.1真实合法</p>
            <p>
                在使用机锋平台服务时，您应当按机锋平台页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话、联系地址等），
                以便机锋在必要时与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性，不得以虚假、冒用的居民身份信息、企业注册信息、
                组织机构代码等注册信息进行注册或认证，任何非法、不真实、不准确的用户信息所产生的责任由您自行承担。您所设置的账户名不得违反国家
                法律法规及机锋平台规则关于账户名的管理规定，否则机锋可对您的账户名进行暂停使用或注销等处理，并向主管机关报告。
            </p>
            <p>
                您理解并承诺，您的账户名称、头像和简介等注册信息中不得出现违法和不良信息，没有冒用、关联机构或社会名人，您在账户
                注册过程中需遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线。
            </p>
            <p>
                如平台发现您在软件中注册或使用的帐号等一切自定义名称与其他用户相同而导致无法识别，机锋平台有权要求您修改上述名称，
                如您在机锋平台要求的时限内未予修改，则机锋平台有权在您自定义的名称后加注识别符号予以区别以确保软件正常运行（例如您希望或正在使用的
                账户名称为“机锋”，但在同一组服务器中同样存在另外一个用户账户名为“机锋”，则在您不愿意修改名称的情况下，机锋平台有权不经您同意的情况
                在您名称后加注识别符号后成为“机锋1”、“机锋2”等），您保证无条件同意上述修改
                您同意并授权，为了更好的为您提供服务以及确保您的账户安全，机锋可以根据您提供的手机号码等信息，向全国公民身份号码查询服务中心、
                电信运营商、金融服务机构等可靠单位发起用户身份真实性、用户征信记录、用户手机号码有效性状态等情况的查询。
            </p>
            <p>3.3.2 更新维护</p>
            <p>
                您应当及时更新您提供的信息（包括但不限于注册资料等），确保符合及时、详尽、真实、准确的要求。在法律有明确规定要求
                机锋对部分用户的信息进行核实的情况下，机锋将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。您在更改、
                删除有关信息的同时也可能会造成储存在系统中的文字、图片、视频等丢失，机锋对您自主操作导致内容丢失不承担责任。
                如机锋按您最后一次提供的信息与您联系未果、您未按机锋的要求及时提供信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，
                您将承担因此对您自身、他人及机锋造成的全部损失与不利后果。机锋可向您发出询问或要求整改的通知，并要求您进行重新认证，
                直至中止、终止对您提供部分或全部机锋平台服务，机锋对此不承担责任。
            </p>
            <p>3.3.3账户安全规范</p>
            <p>
                您的账户为您自行设置并由您保管，机锋任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，
                并确保您在每个上网时段结束时退出登录并以正确步骤离开机锋平台。如您主动通知机锋平台，要求机锋平台采取措施暂停您帐号的登录和使用的，
                机锋平台应当要求您提供并核实与其注册身份信息相一致的个人有效身份信息，否则机锋有权拒绝您的上述请求。机锋平台核实您所提供的
                个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停用户帐号的登录和使用。用户没有提供其个人有效证件或者用户提供
                的个人有效证件与所注册的信息不一致的，机锋平台有权拒绝用户上述请求。
            </p>
            <p>
                账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，均由您自行承担。机锋并不承担责任，您应通过司法、
                行政等救济途径向侵权行为人追偿。
            </p>
            <p>
                您的账户只限您本人使用，不得出借、赠与、出租、未按规定程序转让、售卖或分享他人使用。当您的账户遭到未经授权的使用时，
                您应当立即通知机锋平台，否则未经授权的使用行为均视为您本人的行为，您将自行承担所有由此导致的损失及后果。除机锋存在过错外，
                您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。如发现任何未
                经授权使用您账户登录机锋平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知机锋。您理解机锋对您的任何请求采取行动均
                需要合理时间，且机锋应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除机锋存在法定过错外，机锋不承担责任。
            </p>

            <h4>四、机锋平台服务及规范</h4>
            <h5>4.1机锋平台服务</h5>
            <p>机锋平台向您提供包括但不限于以下服务：</p>
            <p>
                4.1.1机锋直接所有或运营的任何网站，如www.gfan.com
                （及其他由机锋运营的任何网站）；
            </p>
            <p>
                4.1.2机锋直接拥有或运营网站的客户端包括但不限于PC、平板、手机、电视、机顶盒子等全部终端的客户端；
            </p>
            <p>4.1.3机锋平台用户个人中心服务；</p>
            <p>4.1.4机锋论坛发帖服务；</p>
            <p>4.1.5机锋搜索服务；</p>
            <p>4.1.6机锋游戏中心服务；</p>
            <p>4.1.7机锋平台提供的其他技术和/或服务（下称“其他技术和服务”）。</p>
            <p>（以上服务统称为“机锋平台服务”）。</p>
            <br>
            <p>
                机锋平台服务，均仅限于您在机锋平台使用，任何以恶意破解等非法手段将机锋服务与机锋平台分离的行为，均不属于本协议中约定的机锋服务。由此引起的一切法律后果由行为人负责，机锋将依法追究行为人的法律责任。
            </p>
            <p>
                机锋平台网站官方公布的方式为注册、登录、下载、使用机锋服务的唯一合法方式，您通过其他任何渠道、任何途径、任何方式获取的机锋服务（包括但不限于账户、下载等）均为非法取得，机锋概不承认其效力，且一经发现机锋有权立即做出删除、取消、清零、封号等处理，任何因此导致的一切不利后果均由您自行承担，机锋有权依法追究相应人员或机构的法律责任。机锋有权向您公告（包括但不限于弹出页面、网站公告、站内消息等方式）以修改、替换、升级与机锋平台服务相关的任何软件。如果您不同意或者不接受机锋平台服务相关软件的修改、替换、升级，请直接拒绝、停止、取消使用行为，否则视为您同意并接受机锋平台相关软件的修改、替代、升级，同时该同意并接受的行为仍受本协议约束。
            </p>
            <p>
                您理解并认可机锋平台享有如下权利，机锋平台行使如下权利不视为违约，您不追究或者豁免机锋平台的相关法律责任：您使用机锋平台网站或机锋平台账户所获得的经验值、等级、关注、头衔、虚拟奖品及奖励、下载以及机锋平台运营过程中产生并储存于机锋网络数据库的任何数据信息（包括对但不限于账户数据信息、发帖信息、回复信息、行为数据信息等）等衍生物（下称“衍生物”），您确认对其不享有所有权（除非机锋平台另有公告说明），机锋许可您按照机锋平台规则进行使用，机锋对上述衍生物不承担任何赔偿责任。机锋有权根据实际情况自行决定收回日期，无需另行通知您亦无需征得您同意。
            </p>
            <p>
                您同意并保证，不得利用机锋平台服务或其衍生物进行倒卖、转手、置换、抵押有价交易等方式非法牟利。您不会利用机锋平台服务或其衍生物侵犯他人的合法权益，禁止通过网络漏洞、恶意软件或其他非法手段窃取、盗用他人的账户、虚拟奖品等。
            </p>
            <h5>4.2服务规范</h5>
            <p>
                机锋平台账户的所有权归机锋所有，您完成申请注册手续后，获得机锋平台账户的使用权，该使用权仅属于初始申请注册人。您有义务妥善保管在注册并使用机锋平台时获得的账户及密码，并为此组账户及密码登入系统后所开始的一连串行为或活动负责。鉴于网络服务的特殊性，机锋平台不审核是否为您本人使用该组账户及密码，仅审核账户及密码是否与数据库中保存的一致，只要任何人输入的账户及密码与数据库中保存的一致，即可凭借该组账户及密码登陆机锋平台。若使用者并非账户初始申请注册人，机锋平台有权在未经通知的情况下冻结、回收该账户且无需向该账户使用人承担任何法律责任，由此导致的包括并不限于您通讯中断、用户资料和虚拟道具等清空等损失由您自行承担。若账户的归属出现争议的，机锋平台在收到相关方的投诉后，有权暂时冻结该争议账户；争议各方在合理举证期限内提供证据证明账户归属，机锋平台依据各方提供的证据判断归属后，解冻争议账户。
            </p>
            <p>
                您可通过机锋平台服务在机锋平台上传、发布或传输相关内容，包括但不限于文字、图形、图片、音频、视频、音视频、链接等不侵犯他人知识产权或其他合法权益的信息或其他资料（下称“内容”），但您需对此内容承担相关的法律责任。
            </p>
            <p>
                除非有相反证明，机锋将您视为您在机锋平台上传、发布或传输的内容的版权拥有人。您使用机锋平台服务上传、发布或传输内容即代表了您有权且同意，将您在机锋平台上传发布或传输的全部内容（包括但不限于视频、音频，及与本协议事项相关的任何文字、视频、音频等，以下统称“内容成果”）的全部知识产权（包括但不限于著作权、商标权等知识产权以及相关的一切衍生权利）及相关权益，自上传、发布或传输之日起即授权给机锋在全球范围内、不可撤销的、免费使用。协议期内及协议期满后，机锋可以任何方式使用内容成果并享有相应的收益，未经机锋事先书面同意，您不得自行或提供、授权給任何第三方以任何方式使用及获得任何收益。
            </p>
            <p>
                为方便您使用机锋和机锋关联公司的其他相关服务，您授权机锋将您在账户注册和使用机锋平台服务过程中提供、形成的信息传递给机锋关联公司等其他相关服务提供者，或从机锋关联公司等其他相关服务提供者获取您在注册、使用相关服务期间提供、形成的信息。
            </p>
            <p>
                如您在征得机锋同意情况下利用机锋平台实施推广等商业行为和营销内容的，您必须在国家相关法律法规及机锋平台关于推广等商业行为规范的基础上进行。您的商业行为和营销内容，必须本着平等、公平原则进行合理竞争，必须本真着真实准确原则进行合理推广，必须本着保护用户体验原则选择合理的推广方式及营销内容。如您进行恶意竞争，或采取虚假的商业行为、发布虚假夸大的营销内容，或发布频繁的、低质量的营销类信息，或您发布国家相关法规明令禁止的广告内容、违规开展商业行为等，机锋有权将其内容的传播范围、传播对象作出限制，限制或禁止您使用机锋全部或部分服务、注销账户以及依据法律法规保存有关信息并向有关部门报告等。
            </p>
            <p>
                您在机锋平台中与他人进行的商业行为引发的法律纠纷，由交易双方自行处理，机锋不承担任何责任。
            </p>
            <p>
                您理解并知晓在使用机锋平台服务时，所接触的内容和信息来源广泛，机锋无法对该内容和信息的准确性、真实性、可用性、安全性、完整性和正当性负责。您理解并认可您可能会接触到不正确的、令人不快的、不适当的或令人厌恶的内容和信息，您不会以此追究机锋的相关责任。但机锋有权依法停止传输任何前述内容并采取相应处理，包括但不限于暂停您继续使用机锋的部分或全部服务，保存有关记录并向有关机关报告。
            </p>
            <p>
                如您发布新闻信息，你理解并确认您具备互联网新闻信息服务资质，发布的新闻信息真实准确、客观公正。转载新闻信息应当完整准确，不得歪曲新闻信息内容，并在显著位置注明来源，保证新闻信息来源可追溯。机锋平台有权审核你发布的新闻信息，如您发布不实新闻或您不具备发布资质，机锋平台有权将您发布内容的传播范围、传播对象作出限制，限制或禁止您使用机锋全部或部分服务、注销账户以及依据法律法规保存有关信息并向有关部门报告等。
            </p>
            <p>
                机锋不对您在机锋平台上传、发布或传输的任何内容和信息背书、推荐或表达观点，也不对任何内容和信息的错误、瑕疵及产生的损失或损害承担任何责任，您对内容和信息的任何使用需自行承担相关的风险。
            </p>
            <p>
                您同意机锋在提供服务的过程中以各种方式投放商业性广告或其他任何类型的商业信息（包括但不限于在机锋平台的任何位置上投放广告，在您上传、传播的内容中投放广告），您同意接受机锋通过电子邮件、站内消息、手机短信、网站公告或其他方式向您发送促销或其他相关商业信息。同时，机锋有权在上传图片或视频直内添加网站logo（或名称）和时间的水印标志。机锋将尽力但不保证不影响您的使用体验。
            </p>
            <p>
                使用机锋平台服务过程中，您需遵守以下法律法规：《中华人民共和国保守国家秘密法》、《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《信息网络传播权保护条例》、等有关计算机及互联网规定的法律、法规。在任何情况下，机锋一旦合理地认为您的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向您提供服务。
            </p>
            <h5>4.3禁止的内容</h5>
            <p>
                您理解并保证您在机锋平台制作、上传、发布或传输的内容（包括您的账户名称、评论、弹幕等信息）不含有以下内容：
            </p>
            <p>（一）反对宪法确定的基本原则的；</p>
            <p>（二）危害国家统一、主权和领土完整，颠覆国家政权的；</p>
            <p>（三）泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；</p>
            <p>
                （四）煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
            </p>
            <p>（五）破坏国家宗教政策，宣扬邪教、迷信的；</p>
            <p>（六）扰乱社会秩序，破坏社会稳定的；</p>
            <p>
                （七）诱导未成年人违法犯罪和渲染及传播色情、赌博、暴力、凶杀、恐怖活动或者教唆犯罪的；
            </p>
            <p>（八）侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；</p>
            <p>（九）散布谣言，危害社会公德，损害民族优秀文化传统的；</p>
            <p>（十）有关法律、行政法规和国家规定禁止的其他内容；</p>
            <br>
            <p>
                如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给机锋造成不利后果的，您应负责消除影响，并且赔偿机锋因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。
            </p>
            <h5>4.4禁止的行为</h5>
            <p>
                您理解并保证不就机锋平台服务进行下列的禁止的行为，也不允许任何人利用您的账户进行下列行为：
            </p>
            <p>
                1)
                在注册账户时，或使用机锋平台服务（包括但不限于上传、发布、传播信息等）时，冒充他人或机构，或您讹称与任何人或实体有联系（包括设置失实的账户名称或接入另一用户的账户），或您恶意使用注册账户导致其他用户误认；
            </p>
            <p>
                2) 伪造标题或以其他方式操控内容，使他人误认为该内容为机锋所传输；
            </p>
            <p>
                3)
                将无权传输的内容（例如内部资料、机密资料、侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容等）进行上传、发布、发送电子邮件或以其他方式传输；
            </p>
            <p>
                4)
                上传、张贴、发送电子邮件或以其他方式传送任何未获邀约或未经授权的“垃圾电邮”、广告或宣传资料、促销资料，或任何其他商业通讯；
            </p>
            <p>
                5)
                未经机锋明确许可，使用机锋平台服务用于任何商业用途或为任何第三方的利益；
            </p>
            <p>6) 跟踪或以其他方式骚扰他人；</p>
            <p>
                7)
                参与任何非法或有可能非法（由机锋判断）的活动或交易，包括传授犯罪方法、出售任何非法药物、洗钱活动、诈骗等；
            </p>
            <p>8) 赌博、提供赌博数据或透过任何方法诱使他人参与赌博活动；</p>
            <p>
                9)
                使用或利用机锋知识产权（包括机锋的商标、品牌、标志、任何其他专有数据或任何网页的布局或设计），或在其他方面侵犯机锋任何知识产权（包括试图对机锋平台客户端或所使用的软件进行逆向工程）；
            </p>
            <p>
                10)
                通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入机锋平台服务、收集或处理通过机锋平台服务所提供的内容；
            </p>
            <p>
                11)
                参与任何“框架”、“镜像”或其他技术，目的是模仿机锋平台服务的外观和功能；
            </p>
            <p>12) 干预或试图干预任何用户或任何其他方接入机锋平台服务；</p>
            <p>
                13)
                故意散播含有干扰、破坏或限制计算机软件、硬件或通讯设备功能、机锋平台服务、与机锋平台服务相连的服务器和网络的病毒、网络蠕虫、特洛伊木马病毒、已损毁的档案或其他恶意代码或项目等资料；
            </p>
            <p>14) 未经他人明确同意，分享或发布该等人士可识别个人身份的资料；</p>
            <p>
                15)
                探究或测试机锋平台服务、系统或其他用户的系统是否容易入侵攻击，或在其他方面规避（或试图规避）机锋平台服务、系统或其他用户的系统的任何安全功能；
            </p>
            <p>
                16)
                对机锋平台服务所用的软件进行解编、反向编译或逆向工程，或试图作出上述事项；
            </p>
            <p>
                17)
                为破坏或滥用的目的开设多个账户，或恶意上传重复的、无效的大容量数据和信息；
            </p>
            <p>
                18）进行任何破坏机锋平台服务公平性或者其他影响应用正常秩序的行为，如主动或被动刷分、合伙作弊、使用外挂或者其他的作弊软件、利用BUG（又叫“漏洞”或者“缺陷”）来获得不正当的非法利益，或者利用互联网或其他方式将外挂、作弊软件、BUG公之于众；
            </p>
            <p>
                19）进行任何诸如发布广告、销售商品的商业行为，或者进行任何非法的侵害机锋平台利益的行为；
            </p>
            <p>
                20）通过任何渠道或媒体（包括但不限于自媒体等）发出“与机锋合作”、“与机锋共同出品”等任何携带“机锋”品牌的字样，如您宣传推广合作节目，您只能在宣传中提及节目本身而不得提及与机锋关系或者擅自以机锋品牌进行推广，凡是您的发稿带有“机锋”的一切宣传稿件必须通过机锋相应合作部门之书面同意，否则因此给机锋造成的一切损失您应予以赔偿；
            </p>
            <p>
                21）故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。
            </p>
            <h5>4.5用户保证</h5>
            <p>您特此陈述并保证：</p>
            <p>
                1）您当前并未在受美国制裁国家或地区（包括但不限于克里米亚、古巴、伊朗、北朝鲜、及叙利亚）居住或停留；
            </p>
            <p>
                2）您并不属于美国政府禁止或限制主体名单（包括美国财政部海外资产办公室管理的《特别指定国民名单》Specially
                Designated Nationals and Blocked Persons List）的主体或人员；
            </p>
            <p>
                3）您并不属于其他任何遭受美国或联合国经济制裁名单主体或人员，该等名单包括但不限于a）《行业制裁识别名单》Sectoral
                Sanctions Identifications List；b)《海外逃避制裁者名单》 Foreign
                Sanctions Evaders List；c)《巴勒斯坦立法会名单》NON-SDN Palestinian
                Legislative Council List；d)《非SDN涉伊朗制裁法案名单》Non-SDN Iran
                Sanctions Act List等。
            </p>

            <h4>五、第三方链接</h4>
            <p>
                机锋平台服务可能会包含与其他网站或资源的链接。机锋对于前述网站或资源的内容、隐私政策和活动，无权控制、审查或修改，因而也不承担任何责任。机锋建议您在离开机锋平台，访问其他网站或资源前仔细阅读其服务条款和隐私政策。
            </p>

            <h4>六、知识产权</h4>
            <p>
                除非另有约定或机锋另行声明，机锋平台内的所有内容（用户依法享有版权的内容除外）、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利，均归机锋或机锋关联公司所有。未经机锋许可，任何人不得擅自使用（包括但不限于复制、传播、展示、镜像、上载、下载、修改）。
            </p>
            <p>
                机锋平台的Logo、“机锋”、“gfan”、“GFAN”、“Gfan”等文字、图形及其组合，以及机锋平台的其他标识、徵记、产品和服务名称均为机锋或机锋关联公司在中国或其它国家的商标，未经机锋书面授权，任何人不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用或作其他处理。
            </p>
            <p>
                机锋对机锋专有内容、原创内容和其他通过授权取得的独占或独家内容享有完全知识产权。未经机锋许可，任何单位和个人不得私自转载、传播和提供观看服务或者有其他侵犯机锋知识产权的行为，否则将承担包括侵权等所有相关的法律责任。
            </p>

            <h4>七、用户的违约及处理</h4>
            <h5>7.1 违约认定</h5>
            <p>发生如下情形之一的，视为您违约：</p>
            <p>（一）使用机锋平台服务时违反有关法律法规规定的；</p>
            <p>
                （二）违反本协议或本协议补充协议（即本协议第2.2条）约定的。为适应互联网行业发展和满足海量用户对高效优质服务的需求，您理解并同意，机锋可在机锋平台规则中约定违约认定的程序和标准。如：机锋可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。
            </p>
            <h5>7.2 违约处理措施</h5>
            <p>
                您在机锋平台上发布的内容和信息构成违约的，机锋可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、冻结、注销等处理。
                您在机锋平台上实施的行为，或虽未在机锋平台上实施但对机锋平台及其用户产生影响的行为构成违约的，机锋可依据相应规则对您的账户执行限制参加活动、中止向您提供部分或全部服务处理措施。如您的行为构成根本违约的，机锋可查封您的账户，终止向您提供服务。如您的账户被查封，您账户被清空，相关产品服务将被终止提供。
            </p>
            <p>
                如果您在机锋平台上的行为违反相关的法律法规，机锋可依法向相关主管机关报告并提交您的使用记录和其他信息。同时，机锋可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在机锋平台上予以公示。除此之外，机锋可依据国家相关法律法规规定，对您进行黑名单和信用管理，提供与信用等级挂钩的管理和服务，若您被纳入黑名单，有权对纳入黑名单的您采取禁止重新注册帐号的措施，并及时向相关部门报告。
            </p>
            <h5>7.3赔偿责任</h5>
            <p>
                如您的行为使机锋及/或其关联公司遭受损失（包括但不限于自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿机锋及/或其关联公司的上述全部损失。
                如您的行为使机锋及/或其关联公司遭受第三人主张权利，机锋及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。
            </p>
            <h5>7.4特别约定</h5>
            <p>
                如您向机锋及/或其关联公司的雇员等提供实物、现金、现金等价物、劳务、旅游等价值明显超出正常商务洽谈范畴的利益，则可视为您存在商业贿赂行为。发生上述情形的，机锋可立即终止与您的所有合作并向您收取违约金及/或赔偿金，该等金额以机锋因您的贿赂行为而遭受的经济损失和商誉损失作为计算依据。
            </p>
            <p>
                机锋负责"按现状"和"可得到"的状态向您提供机锋平台服务。机锋依法律规定承担相应义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，黑客活动、计算机病毒、电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。
            </p>
            <p>
                机锋通过中华人民共和国境内的设施控制和提供机锋平台服务，机锋不担保控制或提供的服务在其他国家或地区是适当的、可行的，任何在其他司法辖区使用机锋平台服务的用户应自行确保其遵守当地的法律法规，机锋对此不承担任何责任。
            </p>

            <h4>八、协议的变更</h4>
            <p>
                机锋可根据国家法律法规变化及机锋平台服务变化的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过本协议第10条约定的方式通知您。更新后的协议条款一旦公布即代替原来的协议条款。
            </p>
            <p>
                如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用机锋平台服务；如您在变更事项生效后仍继续使用机锋平台服务，则视为您同意已生效的变更事项。
            </p>

            <h4>九、通知</h4>
            <p>您同意机锋以以下合理的方式向您送达各类通知：</p>
            <p>（一）公示的文案；</p>
            <p>（二）站内消息、弹出消息、客户端推送的消息；</p>
            <p>
                （三）根据您预留于机锋平台的联系方式发出的电子邮件、手机短信、函件等；
            </p>
            <p>
                机锋通过上述方式向您发出通知，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
            </p>
            <p>
                对于在机锋平台上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院）可以通过手机短信、电子邮件等现代通讯方式或邮寄方式向您送达法律文书（包括但不限于诉讼文书）。您指定接收法律文书的手机号码、电子邮箱等联系方式为您在机锋平台注册、更新时提供的手机号码、电子邮箱联系方式，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。
            </p>
            <p>
                您同意司法机关可采取以上一种或多种送达方式向您达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。
            </p>
            <p>
                您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于一审、二审、再审、执行以及督促程序等。
            </p>
            <p>
                你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。
            </p>

            <h4>十、协议的终止</h4>

            <h5>10.1 终止的情形</h5>
            <p>您有权通过以下任一方式终止本协议：</p>
            <p>
                （一）在满足机锋平台网站公示的账户注销等清理条件时您通过网站注销您的账户的；
            </p>
            <p>（二）变更事项生效前您停止使用并明示不愿接受变更事项的；</p>
            <p>
                （三）您明示不愿继续使用机锋平台服务，且符合机锋平台终止条件的。
            </p>
            <p>
                出现以下情况时，机锋可以本协议第10条的所列的方式通知您中止或终止本协议：
            </p>
            <p>（一）您违反本协议约定，机锋依据违约条款终止本协议的</p>
            <p>
                （二）您转让本人账户、盗用他人账户、提供虚假注册身份信息、发布违禁内容和信息、骗取他人财物、采取不正当手段谋利等行为，机锋依据机锋平台规则对您的账户予以查封的；
            </p>
            <p>
                （三）除上述情形外，因您多次违反机锋平台规则相关规定且情节严重，机锋依据机锋平台规则对您的账户予以查封的；
            </p>
            <p>（四）您的账户被机锋依据本协议进行注销等清理的；</p>
            <p>（五）您在机锋平台有侵犯他人合法权益或其他严重违法违约行为的；</p>
            <p>（六）其它根据相关法律法规机锋应当终止服务的情况。</p>
            <h5>10.2 协议终止后的处理</h5>
            <p>
                本协议终止后，除法律有明确规定外，机锋无义务向您或您指定的第三方披露您账户中的任何信息。
            </p>
            <p>本协议终止后，机锋享有下列权利：</p>
            <br>
            <p>
                （一）停止收集和使用您的个人信息，但可继续保存您留存于机锋平台的其他内容和信息；
            </p>
            <p>
                （二）对于您过往的违约行为，机锋仍可依据本协议向您追究违约责任。
            </p>

            <h4>十一、法律适用、管辖与其他</h4>
            <p>
                本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。
            </p>
            <p>
                您因使用机锋平台服务所产生及与机锋平台服务有关的争议，由机锋与您协商解决。协商不成时，任何一方均可向人民法院提起诉讼。
            </p>
            <p>
                本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
            </p>
            <div class="btn">
                <el-button @click="agree" type="primary">同意</el-button>
                <el-button @click="reject">拒绝</el-button>
            </div>
        </div>

    </div>

</template>

<script>
    export default {
        name: "Agreement",

        methods: {
            agree() {
                console.log('agree');
            },

            reject() {
                console.log('reject');
            }
        }
    }
</script>

<style scoped>
.content {
    width: auto;
    height: 100%;
    padding: 10px;
    overflow-y: auto;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
    position: fixed;
}

.btn {
    text-align: center;
}
</style>