<template>
    <div class="container" style="height: 100%; overflow-y: auto">
        <div style="margin-bottom: 30px;">

            <h4><span style="color: red;">首善养老</span>服务协议</h4>
            <br />
            <br />
            <h5>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;特别提示</h5>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;本《首善养老服务协议》（以下简称“本协议”）是服务使用人（以下简称“用户”或“您”）与北京元正数据科技有限公司（以下简称“首善养老”）（除非本协议另有明确规定）以及北京元正数据科技有限公司之间关于用户下载、安装、使用“首善养老”软件，注册、使用、管理首善养老用户账号App，以及使用我们合作提供的相关服务所订立的协议。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;为本协议之目的，“首善养老”软件系指由北京元正数据科技有限公司（以下简称“平台方”）开发并作为本协议项下的服务平台的软件，包括移动端应用软件及在第三方网络平台上的公众号和小程序（以下简称“首善养老，APP”）。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;首善养老负责按照本协议的规定及其不时发布的操作规则，并以首善养老、APP作为服务平台和界面，向您提供基于互联网以及移动网的相关服务（以下简称“线上服务”）；</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;首善养老信息负责按照本协议的规定及其不时发布的操作规则，向您提供首善养老的服务和进行线下管理（以下简称“线下服务”）（上述线上、线下服务合称为“服务”或“首善养老服务”）。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;为保障您享受我们提供的前述服务，平台方兹此许可您在获授权的系统及移动终端中下载、安装及使用首善养老、APP。 为获得首善养老服务，请您认真阅读、充分理解本协议（包括其全部补充和附件，下同）的约定和内容，特别是免责条款、隐私政策、首善养老分规则、争议解决条款等。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;请您注意，一经点击“开始”按键，即表示您已同意全部接受本协议；如您不接受本协议的部分或全部内容，请您不要点击“开始”按键。 用户注册、登录首善养老用户账号、获取和使用首善养老服务等行为将视为接受并同意本协议。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;我们通过首善养老、APP不时发布的声明、隐私政策、首善养老分规则等其他规定均属于本协议的补充和组成部分，与本协议具有同等法律效力。 我们可能会根据需要不时修订或更新本协议及其相关补充和附件等文件，修订或更新后的协议和文件一经公布，立刻取代原协议和文件，并自动生效。</p>
            <br />
            <p>&nbsp;&nbsp;&nbsp;&nbsp;如果您不接受相关修订或更新，请立即停止使用首善养老智能服务；如您继续使用首善养老智能服务，即表示您已经充分接受该等修订或更新。</p>
            <br /><br />
            <h5>一、用户注册</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;1.1  用户确认，用户在准备用户注册时，已经具备法律规定的与用户使用首善养老智能服务相适应的民事行为能力以及相应的身体健康条件。请您特别注意，首善养老、APP及服务的用户必须具备适当身体条件的健康人士。用户如患有包括但不限于影响正常生活的颈椎病、腰椎病、癫痫、心脏病、高血压、暂时性眩晕、视力障碍、残疾等疾病的或处于包括但不限于醉酒或间歇性精神疾病发作期间的，不得注册、使用服务。不符合上述必要条件却已注册成为首善养老智能用户的，请您立即终止使用服务。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;1.2  为用户使用首善养老智能服务的目的，平台方兹此授予用户一项为非商业目的在单一台终端设备上安装、使用、显示、运行首善养老的免费的非排他性许可（但不得再许可或分许可）。未经平台方书面同意，用户不得将首善养老安装在未经平台方明示许可的其他终端设备上。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;1.3  当您下载、安装首善养老-APP，通过首善养老-APP提示填写信息、阅读并同意本协议且完成全部身份验证程序后，您即成为首善养老-APP的注册用户。</p>
            <br /><br />
            <h5>二、用户账号和软件知识产权</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.1  用户注册成功后，每个用户将得到一个专属且唯一的用户账号，该账号使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。用户承担其账号与密码的保管责任，除平台方或我们的过错外，用户就其账号及密码项下之一切活动负全部责任，而无论该等活动是否对用户自身或第三方造成任何损害。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.2  如用户发现其账号遭他人非法使用，应立即以首善养老-APP所示方式通知我们。用户理解我们对用户的任何请求采取行动均需要合理时间，因此，除我们存在过错外，我们对在采取行动前已经产生的后果均不承担责任。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.3  用户注册的免费账号昵称、姓名及／或提交的信息如存在违反法律法规或国家政策要求，或侵犯任何第三方合法权益的情况，我们有权禁止用户继续使用该账号、昵称或信息。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.4  首善养老-APP的一切著作权、商标权、专利权、商业秘密等知识产权，以及相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、电子文档等均受中华人民共和国著作权法、商标法、专利法、反不正当竞争法和相应的国际条约以及其他知识产权法律法规的保护，除涉及第三方授权的软件或技术外，平台方享有首善养老-APP及其中所有内容的全部且完整的知识产权。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.5  用户为商业运营目的安装、使用、运行首善养老-APP，但不得对软件或者软件运行过程中释放到任何计算机终端内存中的数据及软件运行过程中客户端与服务器端的交互数据进行复制、更改、修改、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经授权的第三方工具/服务接入首善养老-APP和相关系统。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;2.6  未经平台方书面同意，用户不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何第三方实施、利用、转让上述知识产权，平台方保留追究上述未经许可使用责任的权利。</p>
            <br /><br />
            <h5>三、服务的范围和使用</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.1  首善养老智能服务的具体区域、范围和内容由我们根据实际情况提供，主要包括用户的注册登录、远程监控、数据交换、评价及举报投诉、查询及分享使用历史记录等。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.2  用户在使用首善养老智能服务过程中，应当遵循以下原则：</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  遵守中国可适用的法律、法规和政府规定；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  遵守所有与首善养老智能服务有关的网络协议、规定和程序；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3)  不得为任何非法目的而使用首善养老智能服务；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4)  不得利用技术手段未经授权地访问、记录、盗取、传播首善养老智能服务系统的数据和相关信息；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5)  不得以任何形式利用首善养老智能服务侵犯我们的商业利益，包括但不限于发布非经我们许可的商业或非商业广告；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6)  不得利用首善养老智能服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;7)  不得利用首善养老智能服务系统上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或者其他任何违反法律法规或公序良俗的信息资料；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8)  不得侵犯任何第三方的专利权、著作权、商标权、名誉权、隐私权、个人信息或其他任何合法权益；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9)  不得利用首善养老智能服务系统进行任何损害我们合法权益的行为；</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.3   我们提供的部分服务为收费的服务，用户使用收费服务需要向我们支付一定的费用。该等费用如以下规定将作为一个整体由我们或我们指定的第三方代收方向您计收，但其包括</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  首善养老智能广告就其所提供的线上服务向您收取的技术服务费。</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  首善养老智能信息就其所提供的线下服务向您收取的维护、维修这两部分费用。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.4   对于收费的服务，我们会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费服务。如用户不同意支付相关费用，则我们有权不向用户提供该等收费服务。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.5   在无另行发布的促销、优惠、奖励活动、特殊广告计划的情况下，首善养老-app平台不会另收取任何费用。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.6   我们有权对用户使用首善养老智能服务，包括但不限于收费及免费服务（其中包括基于广告商业模式的免费服务）的情况进行审查和监督(包括但不限于对用户存储在我们处或平台方处的内容进行审核、对用户使用首善养老的行为进行评价)，如用户在使用服务时违反任何上述规定或相关法律法规，我们有权要求用户纠正或直接采取一切必要的措施（包括但不限于更改或删除用户上传、存储或发布的内容，暂停、中断或终止用户使用服务的权利，向用户收取适当的信息管理费等）以减轻不当行为（如有）造成的影响。因用户自身行为需向第三人承担责任的，由用户自行承担，与我们无关。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.7  我 们有权自行划定并通过首善养老-APP向您展示我镇养老、助老运营区，通过系统对首善养老运营区的行为进行判定。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.8   我们有权面向用户开展各类推广、优惠或奖励活动。用户应当严格按照我们发布的相关规则参与活动并享受相关权益。若我们认定用户违反活动规则，或用户采取不正当的手段获取相关权益，则我们有权采取任何合理及必要的行为维护自身的合法权益，包括但不限于终止用户参与活动的资格、暂时或永久冻结用户账户、收回用户以不正当手段从活动中获取的权益（如奖励、优惠券）等。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.9   在我们有理由或根据认为用户可能发生涉嫌违法犯罪、侵犯第三方权益、损害首善养老智能或侵害我们合法权益等的情形时（包括但不限于用户违反本协议第3.2条项下的原则），我们有权不经事前通知用户而先行暂停、中断或终止向用户提供本协议项下的全部或部分服务，且无需对用户或任何第三方承担责任。当用户因本条原因被暂停、中断或终止服务时，用户应按照我们指示行事，否则将被视为违约并应承担本协议项下的违约责任，并且我们保留追究相关方法律责任的权利。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.10   用户理解并同意，我们仅提供与使用首善养老智能服务相关的服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、其他与接入互联网或移动网有关的装置）及第三方收取的相关费用（如为接入互联网而支付的电话费及为使用移动网而支付的第三方额外费用）均应由用户自行负担。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.11   用户理解，我们或平台方需要定期或不定期地对提供服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费服务在合理时间内中断，我们或平台方均无需为此承担责任，但除紧急情况外应当事先通知用户。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;3.12   如发生下列任何一种情形，我们有权随时暂停、中断或终止向用户提供本协议项下的服务，包括但不限于收费及免费的任何服务（其中包括基于广告商业模式的免费服务），而无需对用户或第三方承担责任：</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  用户提供的个人资料的真实性、完整性、准确性、合法性、有效性等存在问题；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  用户违反本协议中规定的账号和/或使用规则或其他约定；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3)  用户在使用收费服务时未按规定向我们支付相应的服务费；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4)  用户的行为涉及违法或侵犯我们或第三方的合法权益；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  基于有管辖权的法院或有权政府机关作出的生效命令、判决、裁决或决定。</p>
            <br /><br />
            <h5>四、首善养老智能的使用及管理</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.1  首善养老智能的信息拥有品牌标记为“首善养老”的智能的所有权以及许可用户使用该智能的权利，并负责智能的日常安装、养护和维修。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.2  未经我们同意，不论首善养老智能状态，用户均不得以除正常使用外的其他任何方式将或其任何部件转移至任何地区。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.3  用户理解并同意，尽管首善养老智能信息依上述第4.1条的规定负有智能的保养和维修义务，用户在实际使用智能前仍应尽到合理的注意及检查义务，包括但不限于细致地检查是否存在损坏，特别是检查是否可使用，本身是否有损坏。对于发现（不论是开锁前还是使用过程中发现），请您立即停止使用，并及时通过首善养老-APP中的故障报修功能通知我们。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.4  用户在使用时应自觉遵守《道路交通安全法》等法律、法规，服从负责部门、交警的指挥和处理。用户因违法违规使用井盖遭受行政处罚或政府处理的，我们有权视情节严重程度采取包括但不限于（根据其独立行使的裁量权和首善养老分规则的相关规定）调整该等用户的首善养老分记录、临时或永久冻结其用户账户及／或限制或停止向其提供首善养老智能服务等措施。如用户在使用服务过程中不幸发生任何意外或事故，除非有证据证明该意外或事故是因井盖本身的固有缺陷直接导致的，否则我们不承担法律责任。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.5  用户所铺设的智能仅限该用户自己使用，或授权他人使用，严禁转租或转借于他人使用，否则由此造成的人身伤害或损失均应由用户承担，我们同时保留向用户追究相应法律责任的权利。如遇台风、暴雨、冰雪等危险天气或不能保证合法、安全使用的其他特殊情况时，您应立即停止使用智能。我们也可根据情况酌情作出暂停服务的措施，并通过信息、广告和相关途径提醒用户。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;4.2  用户在使用智能期间如与第三方发生纠纷应由纠纷双方自行解决，我们不承担任何赔偿义务，如给我们的造成损失的，用户应向我们承担赔偿责任。</p>
            <br /><br />
            <h5>五、用户数据及隐私政策</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.1  用户向我们提供的所有注册资料应当是真实、完整、准确、合法、有效的。如果用户提供的注册资料有所变更，用户应当及时更新，我们将依法不时地对用户信息进行检查核实，用户应当配合提供最及时、真实、完整的信息。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.2  我们将对用户上传的注册资料的真实性、合法性进行审核，并可能提出合理的质询和怀疑，或作出身份验证不通过的结果而无需提供任何理由；用户可以通过再次申请验证或申诉进行重新验证。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.3  依法保护用户隐私是我们的一项基本政策，我们保证不对外公开或向第三方提供单个用户的注册资料及用户在使用服务时存储在首善养老智能服务系统中受法律保护的隐私等个人信息，但下列情况除外：</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  事先获得用户的明确同意；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  根据有关的法律法规要求；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3)  按照相关政府主管部门的要求；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4)  根据法院的生效判决、裁定或命令；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5)  为维护我们的合法权益或社会公共利益而在相关行政程序或司法程序中向政府主管部门或法院提供。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.4  用户理解并同意，我们可能会与第三方合作向用户提供相关的服务，在此情况下，如该等第三方同意承担与我们同等的保护用户隐私的责任，则我们有权将用户的注册资料等提供给该等第三方，用于向用户提供服务之目的。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.5  在不透露单个用户隐私资料的前提下，我们有权对整个用户数据库进行深度分析，并对用户数据库进行商业上的使用或大数据的开发和运用。您理解并确认，《首善养老智能隐私政策》是本协议的有效组成部分，且用户同意并接受我们不时更新的隐私政策。如您不接受现行的或更新后的隐私政策，请立即停止使用首善养老智能服务。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.6  对于用户提供及发布的除个人隐私外的文字、图片、视频、等资料，用户授予我们一项全球范围内的、免使用费的、不可撤销的、可分许可的使用权（不受本协议提前或到期终止的影响）。我们有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发上述资料，并以已知或日后开发的形式、媒体或技术将上述资料纳入其他作品内。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;5.7  用户同意接受我们在提供服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息，并且，用户同意接收我们通过电子邮件、短信、手机推送或其他方式向用户发送的商品、服务信息或其他相关商业信息。</p>
            <br /><br />
            <h5>六、软件隐私权限说明</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;6.1 允许应用读取您手机上的日历</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;说明：此权限用于用户使用本产品核心功能，添加老人吃药提醒</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;6.2  允许应用随时使用相机、相册麦克风权限</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;说明：此权限用于用户使用本产品记录老人的病例档案和自测数据、对商家和文章的评论。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;6.3． 允许应用获取手机定位</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;说明：此权限用于用户定位老人和用户之间的实时定位。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;6.4   允许应用获取广告标识权限</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;说明：此权限用于用户在使用过程中的信息推送。</p>
            <br /><br />
            <h5>七、免责声明</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;7.1  我们对服务不作任何类型的担保，包括但不限于服务的及时性、安全性、准确性，对在任何情况下由可归于用户自身的原因导致的直接、间接、偶然、特殊及后续的损害及风险，我们不承担责任。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;7.2  对于不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户理解并同意，我们对该等风险没有过错，同时，我们不对此承担责任。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;7.3  用户同意，首善养老智能服务受制于中国的法律法规和管理条例，即服务的范围、功能、内容与法律法规和管理条例发生冲突时，应以各地的法律法规和管理条例为准。任何在使用首善养老智能服务过程中违反可适用的法律法规和管理条例的行为，由此引发的不利后果和法律责任应由用户独立承担，与我们无关。用户理解并同意，如有举证需要或要求，我们有义务向有关政府主管部门提供相关数据或信息以配合政府的调查。</p>
            <br /><br />
            <h5>八、违约责任</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;8.1  如因我们违反有关法律、法规或本协议项下的任何条款而给用户造成实际损失，我们同意承担由此造成的违约责任。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;8.2  用户同意保障和维护我们及其他用户的合法权益，如因用户违反有关法律、法规或本协议项下的任何条款而给我们或任何第三方造成损失，用户同意承担由此造成的违约责任，包括但不限于赔偿我们并使我们免于因此遭受所有直接和间接损失（包括任何直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等）。</p>
            <br /><br />
            <h5>九、协议变更及终止</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;9.1  鉴于互联网服务市场及相关领域的快速发展及变化，用户理解并同意，我们有权随时修改本协议的任何条款，一旦本协议的内容发生变动，我们将会直接在首善养老-APP上公布修改之后的协议内容（形式包括但不限于更新版本的协议、补充协议、协议新增附件等），该公布行为视为我们已经通知用户该等修改内容。同时我们也可通过其他适当方式向用户提示修改内容。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;9.2  用户有权在履行完毕相关义务（包括但不限于支付首善养老智能服务全部服务费用（如有的情况下，单方终止本协议。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;9.3  在出现以下任何情况时，我们有权单方终止本协议：</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  用户严重违反本协议约定，或多次违反本协议约定的；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  用户行为存在异常，我们合理怀疑用户可能存在违法或违反本协议约定的行为，如果不终止本协议则可能对我们、其他用户、公共秩序或公共利益造成不利影响的；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3)  用户存在盗用他人账号、发布违禁信息、骗取他人财物、采取不正当手段谋利等行为的；</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4)  其他应当终止本协议的情况的。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;9.4  本协议终止后，除法律另有明确规定外，我们无义务向用户或任何其指定的第三方披露该用户账号中的任何信息。本协议终止后，我们仍享有下列权利：</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1)  继续保存用户留存于首善养老-APP服务系统中的各类信息;</p>
            <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2)  对于用户过往的违约行为，我们仍可依据本协议追究其违约责任。</p>
            <br /><br />
            <h5>十、通知送达</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;10.1 本协议项下我们对于用户所有的通知均可通过首善养老-APP内公告、电子邮件、手机短信或常规的信件传送等方式进行；除常规的信件传送以邮戳载明签收日期为送达日外，其他该等通知均于发送之日视为已送达收件人。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;10.2 用户对于我们的通知应当通过我们对外正式公布的通信地址或电子邮件地址等联系信息进行送达。</p>
            <br /><br />
            <h5>十一、适用法律与争议解决</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;11.1  本协议的订立、履行和解释及与之相关的争议的解决均应适用中华人民共和国法律。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;11.2  如双方就本协议及其所有补充和附件的签署、内容、解释或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，对于因本协议及其所有补充和附件而产生的或与之有关的一切争议，任何一方应向北京元正数据科技有限公司所在地法院仲裁。</p>
            <br /><br />
            <h5>十二、其他规定</h5>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;12.1  如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，不影响本协议其他条款的效力。在此情形下，各方应当在合法范围内协商确定新的条款，以保证最大限度的实现原有条款的意图。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;12.2  本协议中的标题仅为方便而设，在解释本协议时不应受该等标题的限制。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;12.3  任何一方当事人放弃或者延迟行使其在本协议项下的全部或部分权利的，不应视为其放弃本协议项下的任何其他权利或与此类似的一切权利。</p>
            <br /><p>&nbsp;&nbsp;&nbsp;&nbsp;12.4  本协议构成各方之间就本协议内容所达成的完全合意；本协议签署前存在的、或与本协议相矛盾或抵触的一切合意，无论其为口头、书面或其他形式均归于无效。</p>
            <!--<div class="btn">-->
                <!--<el-button @click="agree" type="primary">同意</el-button>-->
                <!--<el-button @click="reject">拒绝</el-button>-->
            <!--</div>-->
        </div>

    </div>

</template>

<script>
    export default {
        name: "Agreement",

        methods: {
            agree() {
                console.log('agree');
            },

            reject() {
                console.log('reject');
            }
        }
    }
</script>

<style scoped>
.content {
    width: auto;
    height: 100%;
    padding: 10px;
    overflow-y: auto;
    -webkit-box-sizing: border-box;
    box-sizing: border-box;
    position: fixed;
}

.btn {
    text-align: center;
}

p {
    font-size: 14px;
}
</style>